import re # Імпортую бібліотеку re

#*************************************************************
set_string = 'Это просто строка текста. А это еще одна строка текста'

#*************************************************************
pattern = 'строка'
print('1 -->', pattern in set_string)# 1 --> True

#*************************************************************
# Використовую метод search

if re.search(pattern, set_string): # Якщо наш патерн є у строці
    print('2 -->', 'Matched')
else:
    print('2 -->', 'No match')# Якщо наш патерн не є у строці
# 2 --> Matched

#*************************************************************
# Можна результат роботи search присвоїти одразу у змінну
match = re.search(pattern, set_string)
print('3 -->', match)
#3 --> <re.Match object; span=(11, 17), match='строка'>
'''
span=(11, 17) - це зріз найденої строки у патерні (індекси)
'''

#*************************************************************
# Можна роздрукувати або присвоїти безпосередньо зріз першого входження строки у патерні:
print('4 -->', match.span())
# 4 --> (11, 17)

#*************************************************************
# Можна роздрукувати або присвоїти початковий індекс першого входження строки у патерні:
print('5 -->', match.start())
#5 --> 11

#*************************************************************
# Можна роздрукувати або присвоїти кінцевий індекс першого входження строки у патерні:
print('6 -->', match.end())
#6 --> 17

#*************************************************************
# Використовую метод match