# **********************************************************************************************************************
# **********************************************************************************************************************
# *****Lesson 22 'set и frozenset'
print('************************************','Lesson 22 set и frozenset','********************************************')
s = {'apple', 'orange', 'apple', 'pear', 'orange', 'banana'}
print(s)# {'orange', 'pear', 'banana', 'apple'}

s2 = set('hello')
print(s2)# {'e', 'h', 'l', 'o'}

s3 = {i for i in range(1, 11)}
print(s3)#{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

s4 = set()
print(s4)#set()

print('***************************************************************************************************************')
nums = [1, 2, 3, 3, 1, 2, 4, 5]
nums2 = set(nums)
print(nums2) #{1, 2, 3, 4, 5}

print('***************************************************************************************************************')
a = set('abracadabra')#{'r', 'd', 'b', 'c', 'a'}
b = set('alacazam')#{'z', 'l', 'c', 'a', 'm'}
c = a - b# вычитание - убираем из a все буквы, которые есть в b #{'r', 'd', 'b'}

d = a | b# объединение - буквы или в a или в b # {'z', 'l', 'r', 'd', 'b', 'c', 'a', 'm'}

e = a & b# пересечение - буквы и в a и в b # {'c', 'a'}

f = a ^ b# множество из элементов - буквы в a или b, но не в обоих # {'z', 'm', 'l', 'r', 'd', 'b'}
print(a, b, c, d, e, f, sep='\n')

#print('***************************************************************************************************************')
# set.copy() - возвращает копию множества
# set.add(elem) - добавляет элемент в множество
# set.remove(elem) - удаляет элемент из множества. KeyError, если такого элемента не существует
# set.discard(elem) - удаляет элемент, если он находится в множестве
# set.pop() - возвращает и удаляет первый элемент из множества. Так как множества не упорядочены, нельзя точно сказать, какой элемент будет первым.
# set.clear() - очистка множества

print('***************************************************************************************************************')
s = {'apple', 'orange', 'apple', 'pear', 'orange', 'banana'}
s2 = s.copy()
s.clear()

print(s, id(s)) #set() 2453272298440
print(s2, id(s2)) #{'apple', 'pear', 'banana', 'orange'} 2453272044040

print('***************************************************************************************************************')
a = frozenset('hello')
print(a)



